In [3]:
print ("This is my first Python Code")

This is my first Python Code

In [2]:
x=2
y=3
z=x*y

In [3]:
z

6

In [4]:
names=["Qing", "Françoise", "Raúl", "Bjork","Marie"]
ages=[32,33,28,30,29]
country=["China", "Senegal", "España", "Norway","Korea"]
education=["Bach", "Bach", "Master", "PhD","PhD"]

In [5]:
classroom={'student':names,'age':ages,'edu':education}
# see it:

classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie'],
 'age': [32, 33, 28, 30, 29],
 'edu': ['Bach', 'Bach', 'Master', 'PhD', 'PhD']}

In [6]:
classroom['student']

['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie']

In [7]:
classroom.update({'country':country})
# now:
classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie'],
 'age': [32, 33, 28, 30, 29],
 'edu': ['Bach', 'Bach', 'Master', 'PhD', 'PhD'],
 'country': ['China', 'Senegal', 'España', 'Norway', 'Korea']}

In [8]:
import pandas

In [9]:
# our data frame:
students=pandas.DataFrame(classroom)
## see it:
students

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Raúl   28  Master   España
3      Bjork   30     PhD   Norway
4      Marie   29     PhD    Korea

In [10]:
names=["Qing", "Françoise", "Raúl", "Bjork","Marie"]
#
classroom.update({'student':names})
#
classroom

{'student': ['Qing', 'Françoise', 'Raúl', 'Bjork', 'Marie'],
 'age': [32, 33, 28, 30, 29],
 'edu': ['Bach', 'Bach', 'Master', 'PhD', 'PhD'],
 'country': ['China', 'Senegal', 'España', 'Norway', 'Korea']}

In [11]:
#then
students=pandas.DataFrame({key:pandas.Series(value) for key, value in classroom.items()})

# seeing it:
students

     student  age     edu  country
0       Qing   32    Bach    China
1  Françoise   33    Bach  Senegal
2       Raúl   28  Master   España
3      Bjork   30     PhD   Norway
4      Marie   29     PhD    Korea